{
  "base_model_name_or_path": "nvidia/NVIDIA-Nemotron-3-Nano-30B-A3B-Base-BF16",
  "peft_type": "LORA",
  "task_type": "CAUSAL_LM",
  "r": 32,
  "lora_alpha": 16,
  "target_modules": ".*\\.(in_proj|out_proj|up_proj|down_proj)$",
  "lora_dropout": 0.05,
  "bias": "none"
}